tangyangguang/Esp32_Faucet/src/app/AppController.cpp
#include "app/AppController.h"

#include "app/TimeUtils.h"

#include <algorithm>
#include <cstdio>
#include <limits>
#include <new>

#ifndef NATIVE_BUILD
#include <Esp32Base.h>
#define APP_RESULT_LOG_I(tag, fmt, ...) ESP32BASE_LOG_I(tag, fmt, ##__VA_ARGS__)
#else
#define APP_RESULT_LOG_I(tag, fmt, ...) \
    do {                                \
    } while (0)
#endif

namespace faucet {
namespace {

std::uint32_t msFromSeconds(std::uint32_t seconds) {
    constexpr std::uint32_t maxMs = std::numeric_limits<std::uint32_t>::max();
    return seconds > maxMs / 1000UL ? maxMs : seconds * 1000UL;
}

WaterPulseTraceState traceStateForResult(WaterResult result) {
    switch (result) {
        case WaterResult::Completed:
            return WaterPulseTraceState::Completed;
        case WaterResult::StoppedByUser:
            return WaterPulseTraceState::Stopped;
        case WaterResult::PauseTimeout:
            return WaterPulseTraceState::PauseTimeout;
        case WaterResult::SafetyStopped:
            return WaterPulseTraceState::SafetyStopped;
        case WaterResult::FlowError:
        default:
            return WaterPulseTraceState::Error;
    }
}

bool isCancelButtonEvent(ButtonEventType type) {
    return type == ButtonEventType::CancelDown || type == ButtonEventType::CancelShort ||
           type == ButtonEventType::CancelLong;
}

constexpr std::uint32_t kResultOkCalibrationHoldMs = 5000UL;
constexpr std::uint32_t kLocalRecordCalibrationStepMl = 100UL;

MeteringSchemeRecord defaultRuntimeMeteringScheme() {
    MeteringSchemeRecord scheme{};
    initializeManualMeteringScheme(scheme, 1, "默认计量方案", defaultMeteringParameters(), 0);
    return scheme;
}

bool appendSessionCalibrationSample(const CalibrationStoredTrace& stored,
                                    const CalibrationSessionTraceStore& traceStore,
                                    std::uint8_t slot,
                                    const SegmentedCalibrationOptions& options,
                                    SegmentedCalibrationSample* samples,
                                    std::size_t sampleCapacity,
                                    std::uint32_t* sourceIds,
                                    std::size_t& sampleCount) {
    if (!samples || !sourceIds || sampleCount >= sampleCapacity || !stored.valid || stored.pendingActual ||
        stored.actualMl == 0 || stored.trace.sampleCount < 6 || stored.trace.totalPulses == 0 ||
        stored.trace.truncated || stored.trace.resumedAfterPause) {
        return false;
    }
    WaterPulseTraceSample* traceSamples = new (std::nothrow) WaterPulseTraceSample[stored.trace.sampleCount]{};
    if (!traceSamples) {
        return false;
    }
    const std::size_t copied = traceStore.readSamples(slot, traceSamples, stored.trace.sampleCount);
    if (copied != stored.trace.sampleCount) {
        delete[] traceSamples;
        return false;
    }
    const WaterPulseTraceAnalysis analysis =
        analyzeWaterPulseTrace(stored.trace, traceSamples, stored.trace.sampleCount, options);
    delete[] traceSamples;
    if (!analysis.stable || analysis.stablePulseCount == 0) {
        return false;
    }
    samples[sampleCount] = SegmentedCalibrationSample{
        stored.actualMl,
        stored.trace.totalPulses,
        analysis.startupPulseCount,
        analysis.stablePulseCount,
        analysis.stableStartSec,
        analysis.stablePulsePerSec,
    };
    sourceIds[sampleCount] = stored.trace.traceId == 0 ? static_cast<std::uint32_t>(slot + 1) : stored.trace.traceId;
    ++sampleCount;
    return true;
}

bool calibrationStatusExpiresWhenIdle(CalibrationSessionStatus status) {
    return status == CalibrationSessionStatus::Preparing ||
           status == CalibrationSessionStatus::WaitingLocalRun ||
           status == CalibrationSessionStatus::AwaitingActual ||
           status == CalibrationSessionStatus::ReadyToGenerate ||
           status == CalibrationSessionStatus::Generated;
}

void fillCandidateFromSegmentedResult(MeteringSchemeCandidate& candidate,
                                      const SegmentedCalibrationResult& result,
                                      const SegmentedCalibrationOptions& options,
                                      const std::uint32_t* sourceIds,
                                      std::size_t sourceCount,
                                      std::uint32_t nowSeconds,
                                      MeteringSchemeSource sourceType) {
    (void)options;
    (void)sourceIds;
    (void)sourceCount;
    candidate = MeteringSchemeCandidate{};
    candidate.ready = true;
    candidate.sourceType = sourceType;
    candidate.params = MeteringParameters{
        result.startupPulseCount,
        result.startupVolumeMl,
        result.stablePulsePerLiter,
        result.startupDurationMs,
        result.stableFlowMlPerMin,
    };
    candidate.generatedAt = nowSeconds;
    candidate.sampleCount = result.sampleCount;
    candidate.minActualMl = result.minActualMl;
    candidate.maxActualMl = result.maxActualMl;
    candidate.maxErrorMl = result.maxErrorMl;
    candidate.maxErrorTenthPercent = result.maxRelativeErrorTenthPercent;
}

}  // namespace

AppController::AppController(const SystemConfig& config,
                             StatisticsStore& statistics,
                             FilterStore& filters,
                             WaterRecordWriter& records,
                             WaterPulseTraceStore* pulseTraces,
                             WaterRecordCalibrationWriter* recordCalibrations,
                             CalibrationSessionFileStore* calibrationSessions,
                             CalibrationSessionTraceStore* calibrationSessionTraces,
                             CalibrationLongTermSampleStore* calibrationLongTermSamples,
                             WaterSensorManager* waterSensors)
    : AppController(config,
                    defaultRuntimeMeteringScheme(),
                    statistics,
                    filters,
                    records,
                    nullptr,
                    pulseTraces,
                    recordCalibrations,
                    calibrationSessions,
                    calibrationSessionTraces,
                    calibrationLongTermSamples,
                    waterSensors) {}

AppController::AppController(const SystemConfig& config,
                             const MeteringSchemeRecord& activeScheme,
                             StatisticsStore& statistics,
                             FilterStore& filters,
                             WaterRecordWriter& records,
                             MeteringSchemeStore& meteringSchemes,
                             WaterPulseTraceStore* pulseTraces,
                             WaterRecordCalibrationWriter* recordCalibrations,
                             CalibrationSessionFileStore* calibrationSessions,
                             CalibrationSessionTraceStore* calibrationSessionTraces,
                             CalibrationLongTermSampleStore* calibrationLongTermSamples,
                             WaterSensorManager* waterSensors)
    : AppController(config,
                    activeScheme,
                    statistics,
                    filters,
                    records,
                    &meteringSchemes,
                    pulseTraces,
                    recordCalibrations,
                    calibrationSessions,
                    calibrationSessionTraces,
                    calibrationLongTermSamples,
                    waterSensors) {}

AppController::AppController(const SystemConfig& config,
                             const MeteringSchemeRecord& activeScheme,
                             StatisticsStore& statistics,
                             FilterStore& filters,
                             WaterRecordWriter& records,
                             MeteringSchemeStore* meteringSchemes,
                             WaterPulseTraceStore* pulseTraces,
                             WaterRecordCalibrationWriter* recordCalibrations,
                             CalibrationSessionFileStore* calibrationSessions,
                             CalibrationSessionTraceStore* calibrationSessionTraces,
                             CalibrationLongTermSampleStore* calibrationLongTermSamples,
                             WaterSensorManager* waterSensors)
    : config_(config),
      activeMeteringScheme_(activeScheme),
      water_(config_),
      localMode_(LocalUiMode::Normal),
      buttons_(),
      flow_(activeMeteringScheme_.params, config_.pulseMinIntervalUs),
      valve_(config_.valveFullPowerSec, config_.valveHoldDutyPercent),
      statistics_(statistics),
      filters_(filters),
      records_(records),
      recordCalibrations_(recordCalibrations),
      meteringSchemes_(meteringSchemes),
      pulseTraces_(pulseTraces),
      waterSensors_(waterSensors),
      calibrationSessions_(calibrationSessions),
      calibrationSessionTraces_(calibrationSessionTraces),
      calibrationLongTermSamples_(calibrationLongTermSamples),
      calibrationSession_{},
      activeTraceId_(0),
      activeTraceStartUs_(0),
      lastFlowVolumeMl_(0),
      currentFlowMlPerMin_(0),
      instantFlowMlPerMin_(0),
      windowFlowMlPerMin_(0),
      displayFlowMlPerMin_(0),
      runAverageFlowMlPerMin_(0),
      activeStartTimeSec_(0),
      activeStartTimeSynced_(false),
      activeStartBootId_(0),
      lastValveDesiredOpen_(false),
      calibrationValveOpen_(false),
      lastRecordWriteOk_(true),
      valveOutputSink_(nullptr),
      persistenceDirty_(false),
      configDirty_(false),
      pendingBeep_(BeepPattern::None),
      flowDroppedPulses_(0),
      resultDisplayStartMs_(0),
      resultOkHoldStartMs_(0),
      resultOkHoldActive_(false),
      resultOkCalibrationEntered_(false),
      adjustmentStepMl_(config_.volumeAdjustStepMl),
      timeAdjustmentStepSec_(config_.timeAdjustStepSec),
      localCalibrationActualMl_(0),
      localCalibrationStepMl_(kLocalRecordCalibrationStepMl),
      localCalibrationIgnoreOkUntilRelease_(false),
      localCalibrationOkReleaseSeen_(false),
      localCalibrationOkReleaseStartMs_(0),
      lastResultRecordValid_(false),
      lastResultRecord_{} {
    sanitizeConfig(config_);
    if (meteringSchemes_ &&
        (!activeMeteringScheme_.recordUsed || !validMeteringSchemeParameters(activeMeteringScheme_.params))) {
        activeMeteringScheme_ = defaultRuntimeMeteringScheme();
        flow_.setMeteringParameters(activeMeteringScheme_.params);
    }
    restoreCalibrationSession();
}

