tangyangguang/Esp32_Faucet/src/app/AppController.cpp
const MeteringSchemeRecord& AppController::activeMeteringScheme() const {
    return activeMeteringScheme_;
}

BeepPattern AppController::consumeBeepPattern() {
    const BeepPattern pattern = pendingBeep_;
    pendingBeep_ = BeepPattern::None;
    return pattern;
}

bool AppController::emergencyStop(std::uint32_t nowMs) {
    const WaterState state = water_.snapshot().state;
    water_.stop(nowMs);
    syncValve(nowMs);
    if (state == WaterState::Running || state == WaterState::Paused) {
        pendingBeep_ = BeepPattern::Error;
        return true;
    }
    return false;
}

void AppController::setValveOutputSink(ValveOutputSink sink) {
    valveOutputSink_ = sink;
}

void AppController::setFlowDroppedPulses(std::uint32_t droppedPulses) {
    flowDroppedPulses_ = droppedPulses;
}

bool AppController::selectNextPresetForWeb() {
    return water_.selectNextPreset();
}

bool AppController::selectPreviousPresetForWeb() {
    return water_.selectPreviousPreset();
}

bool AppController::selectPresetForWeb(std::size_t index) {
    return water_.selectPreset(index);
}

bool AppController::canApplyConfig() const {
    return localMode_ != LocalUiMode::Result && localMode_ != LocalUiMode::RecordCalibration &&
           water_.canApplyConfig();
}

bool AppController::applyConfig(const SystemConfig& config) {
    if (!canApplyConfig() || !water_.applyConfig(config)) {
        return false;
    }
    SystemConfig safe = config;
    sanitizeConfig(safe);
    config_ = safe;
    flow_.setPulseFilterUs(config_.pulseMinIntervalUs);
    valve_.configure(config_.valveFullPowerSec, config_.valveHoldDutyPercent);
    adjustmentStepMl_ = config_.volumeAdjustStepMl;
    timeAdjustmentStepSec_ = config_.timeAdjustStepSec;
    if (pulseTraces_) {
        pulseTraces_->setRecentTraceLimit(kRecentPulseTraceCount);
    }
    if (waterSensors_) {
        waterSensors_->configure(config_);
    }
    return true;
}

bool AppController::applyActiveMeteringScheme(const MeteringSchemeRecord& activeScheme) {
    if (!canApplyConfig() || !activeScheme.recordUsed ||
        activeScheme.deleted ||
        !validMeteringSchemeParameters(activeScheme.params)) {
        return false;
    }
    activeMeteringScheme_ = activeScheme;
    flow_.setMeteringParameters(activeMeteringScheme_.params);
    return true;
}

bool AppController::startCalibrationSessionForWeb(std::uint32_t nowSeconds) {
    if (water_.snapshot().state != WaterState::Idle || !calibrationSessions_ || !calibrationSessions_->ready() ||
        !calibrationSessionTraces_ || !calibrationSessionTraces_->ready() ||
        (calibrationSession_.status != CalibrationSessionStatus::Idle &&
         calibrationSession_.status != CalibrationSessionStatus::Applied &&
         calibrationSession_.status != CalibrationSessionStatus::Discarded &&
         calibrationSession_.status != CalibrationSessionStatus::Failed)) {
        return false;
    }
    const std::uint32_t sessionId = nowSeconds == 0 ? 1 : nowSeconds;
    if (!calibrationSessionTraces_->clearForNewSession(sessionId)) {
        return false;
    }
    calibrationSession_ = makeCalibrationSession(sessionId, nowSeconds);
    calibrationCandidate_ = MeteringSchemeCandidate{};
    if (!saveCalibrationSession()) {
        calibrationSession_ = CalibrationSessionRecord{};
        return false;
    }
    localMode_ = LocalUiMode::Calibration;
    pendingBeep_ = BeepPattern::Click;
    return true;
}

bool AppController::discardCalibrationSessionForWeb(std::uint32_t nowSeconds) {
    if (localMode_ != LocalUiMode::Calibration || calibrationSession_.status == CalibrationSessionStatus::Running ||
        water_.snapshot().state == WaterState::Running || water_.snapshot().state == WaterState::Paused) {
        return false;
    }
    calibrationSession_.status = CalibrationSessionStatus::Discarded;
    calibrationCandidate_ = MeteringSchemeCandidate{};
    calibrationSession_.updatedAt = nowSeconds;
    const bool ok = saveCalibrationSession();
    localMode_ = LocalUiMode::Normal;
    return ok;
}

bool AppController::submitCalibrationActualForWeb(std::uint32_t actualMl, std::uint32_t nowSeconds) {
    if (calibrationSession_.status != CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.attemptCount == 0 || actualMl < kCalibrationMinActualMl || !recordCalibrations_ ||
        !calibrationSessionTraces_) {
        return false;
    }
    CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
    const WaterPulseTrace* trace = pulseTraces_ ? pulseTraces_->findByRecord(attempt.record) : nullptr;
    if (attempt.status != CalibrationAttemptStatus::PendingActual || !trace || trace->truncated ||
        trace->resumedAfterPause || trace->sampleCount == 0 ||
        trace->sampleCount > kPulseTraceMaxRawEdgesPerTrace || trace->totalPulses == 0) {
        attempt.status = CalibrationAttemptStatus::Invalid;
        attempt.invalidReason = CalibrationInvalidReason::AnalysisFailed;
        calibrationSession_.updatedAt = nowSeconds;
        saveCalibrationSession();
        return false;
    }
    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[trace->sampleCount]{};
    if (!samples) {
        attempt.status = CalibrationAttemptStatus::Invalid;
        attempt.invalidReason = CalibrationInvalidReason::StorageFailed;
        calibrationSession_.updatedAt = nowSeconds;
        saveCalibrationSession();
        return false;
    }
    for (std::size_t i = 0; i < trace->sampleCount; ++i) {
        const WaterPulseTraceSample* sample = pulseTraces_->sampleAt(*trace, i);
        if (sample) {
            samples[i] = *sample;
        }
    }
    CalibrationStoredTrace stored{};
    stored.pendingActual = true;
    stored.sessionId = calibrationSession_.sessionId;
    stored.attemptIndex = attempt.attemptIndex;
    stored.trace = *trace;

    WaterRecordCalibration calibration = makeWaterRecordCalibration(attempt.record);
    calibration.actualMl = actualMl;
    calibration.calibratedAt = nowSeconds;
    calibration.oldPulsePerMl = static_cast<float>(activeMeteringScheme_.params.stablePulsePerLiter) / 1000.0f;
    calibration.newPulsePerMl = calibration.oldPulsePerMl;
    calibration.oldStartupCompensationMl = activeMeteringScheme_.params.startupVolumeMl;
    calibration.newStartupCompensationMl = activeMeteringScheme_.params.startupVolumeMl;
    calibration.kind = WaterRecordCalibrationKind::PulsePerMl;
    if (!recordCalibrations_->upsert(calibration) ||
        !calibrationSessionTraces_->savePending(attempt.sessionTraceSlot, stored, samples, trace->sampleCount) ||
        !calibrationSessionTraces_->commitValid(attempt.sessionTraceSlot, actualMl, nowSeconds)) {
        delete[] samples;
        attempt.status = CalibrationAttemptStatus::Invalid;
        attempt.invalidReason = CalibrationInvalidReason::StorageFailed;
        calibrationSession_.updatedAt = nowSeconds;
        saveCalibrationSession();
        return false;
    }
    delete[] samples;

    attempt.actualMl = actualMl;
    attempt.status = CalibrationAttemptStatus::Valid;
    attempt.invalidReason = CalibrationInvalidReason::None;
    calibrationSession_.validSampleCount = countValidCalibrationSamples(calibrationSession_);
    calibrationSession_.updatedAt = nowSeconds;
    if (pulseTraces_) {
        pulseTraces_->setActualMlByRecord(attempt.record, actualMl);
    }
    pendingBeep_ = BeepPattern::Done;
    if (calibrationCanQuickGenerate(calibrationSession_)) {
        return refreshCalibrationCandidate(nowSeconds);
    }
    clearCalibrationCandidate();
    calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                : CalibrationSessionStatus::Failed;
    return saveCalibrationSession();
}

