tangyangguang/Esp32_Faucet/src/app/AppController.cpp
bool AppController::saveCalibrationSessionSampleToLongTermForWeb(std::uint8_t attemptIndex,
                                                                 std::uint32_t nowSeconds,
                                                                 std::uint32_t& sampleId) {
    sampleId = 0;
    if (!calibrationLongTermSamples_ || !calibrationLongTermSamples_->ready() || !calibrationSessionTraces_ ||
        !calibrationSessionTraces_->ready() || water_.snapshot().state != WaterState::Idle) {
        return false;
    }

    const CalibrationAttempt* selected = nullptr;
    for (std::uint8_t i = 0; i < calibrationSession_.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = calibrationSession_.attempts[i];
        if (attempt.attemptIndex == attemptIndex) {
            selected = &attempt;
            break;
        }
    }
    if (!selected || selected->status != CalibrationAttemptStatus::Valid ||
        selected->sessionTraceSlot >= kCalibrationSessionTraceSlots) {
        return false;
    }

    CalibrationStoredTrace existing[kCalibrationLongTermSampleSlots]{};
    const std::size_t existingCount =
        calibrationLongTermSamples_->list(existing, kCalibrationLongTermSampleSlots);
    for (std::size_t i = 0; i < existingCount; ++i) {
        if (existing[i].sessionId == calibrationSession_.sessionId &&
            existing[i].attemptIndex == selected->attemptIndex) {
            sampleId = existing[i].sampleId;
            calibrationSession_.updatedAt = nowSeconds;
            return saveCalibrationSession();
        }
    }

    CalibrationStoredTrace stored{};
    if (!calibrationSessionTraces_->load(selected->sessionTraceSlot, stored) || !stored.valid ||
        stored.pendingActual || stored.actualMl == 0 || stored.trace.sampleCount == 0 ||
        stored.trace.sampleCount > kPulseTraceMaxRawEdgesPerTrace) {
        return false;
    }

    WaterPulseTraceSample* samples = new (std::nothrow) WaterPulseTraceSample[stored.trace.sampleCount]{};
    if (!samples) {
        return false;
    }
    const std::size_t copied =
        calibrationSessionTraces_->readSamples(selected->sessionTraceSlot, samples, stored.trace.sampleCount);
    if (copied != stored.trace.sampleCount) {
        delete[] samples;
        return false;
    }
    stored.sessionId = calibrationSession_.sessionId;
    stored.attemptIndex = selected->attemptIndex;
    stored.savedAt = nowSeconds;
    const bool saved = calibrationLongTermSamples_->save(stored, samples, copied, sampleId);
    delete[] samples;
    if (!saved) {
        return false;
    }
    calibrationSession_.updatedAt = nowSeconds;
    pendingBeep_ = BeepPattern::Done;
    return saveCalibrationSession();
}

bool AppController::removeCalibrationSessionSampleForWeb(std::uint8_t attemptIndex, std::uint32_t nowSeconds) {
    if (water_.snapshot().state != WaterState::Idle) {
        return false;
    }

    std::uint8_t selectedIndex = kCalibrationMaxAttempts;
    for (std::uint8_t i = 0; i < calibrationSession_.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = calibrationSession_.attempts[i];
        if (attempt.attemptIndex == attemptIndex) {
            selectedIndex = i;
            break;
        }
    }
    const CalibrationAttempt* selected =
        selectedIndex < kCalibrationMaxAttempts ? &calibrationSession_.attempts[selectedIndex] : nullptr;
    if (!selected || (selected->status != CalibrationAttemptStatus::Valid &&
                      selected->status != CalibrationAttemptStatus::PendingActual)) {
        return false;
    }
    CalibrationSessionRecord nextSession = calibrationSession_;
    CalibrationAttempt& nextAttempt = nextSession.attempts[selectedIndex];
    nextAttempt.status = CalibrationAttemptStatus::Removed;
    nextAttempt.skipReason = CalibrationSkipReason::None;
    nextAttempt.invalidReason = CalibrationInvalidReason::None;
    nextSession.validSampleCount = countValidCalibrationSamples(nextSession);
    nextSession.updatedAt = nowSeconds;
    const bool canQuickGenerateAfterRemove = calibrationCanQuickGenerate(nextSession);
    nextSession.status = canQuickGenerateAfterRemove ? CalibrationSessionStatus::ReadyToGenerate
                                                     : (calibrationCanStartAttempt(nextSession)
                                                            ? CalibrationSessionStatus::WaitingLocalRun
                                                            : CalibrationSessionStatus::Failed);

    if (!calibrationSessions_ || !calibrationSessions_->ready() || !calibrationSessions_->save(nextSession)) {
        return false;
    }

    const CalibrationSessionRecord originalSession = calibrationSession_;
    if (calibrationSessionTraces_ && selected->sessionTraceSlot < kCalibrationSessionTraceSlots &&
        !calibrationSessionTraces_->invalidate(selected->sessionTraceSlot)) {
        calibrationSessions_->save(originalSession);
        return false;
    }

    calibrationSession_ = nextSession;
    clearCalibrationCandidate();
    if (canQuickGenerateAfterRemove) {
        return refreshCalibrationCandidate(nowSeconds);
    }
    return true;
}

bool AppController::skipCalibrationAttemptForWeb(CalibrationSkipReason reason, std::uint32_t nowSeconds) {
    if (calibrationSession_.status != CalibrationSessionStatus::AwaitingActual ||
        calibrationSession_.attemptCount == 0) {
        return false;
    }
    CalibrationAttempt& attempt = calibrationSession_.attempts[calibrationSession_.attemptCount - 1];
    if (calibrationSessionTraces_ && attempt.sessionTraceSlot < kCalibrationSessionTraceSlots) {
        calibrationSessionTraces_->invalidate(attempt.sessionTraceSlot);
    }
    attempt.status = CalibrationAttemptStatus::Skipped;
    attempt.skipReason = reason;
    calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                : CalibrationSessionStatus::Failed;
    calibrationSession_.updatedAt = nowSeconds;
    return saveCalibrationSession();
}

