tangyangguang/Esp32_Faucet/src/app/AppController.cpp
bool AppController::generateCalibrationForWeb(std::uint32_t nowSeconds) {
    return refreshCalibrationCandidate(nowSeconds) &&
           calibrationSession_.status == CalibrationSessionStatus::Generated &&
           calibrationCandidate_.ready;
}

bool AppController::refreshCalibrationCandidate(std::uint32_t nowSeconds) {
    clearCalibrationCandidate();
    calibrationSession_.validSampleCount = countValidCalibrationSamples(calibrationSession_);
    if (calibrationSession_.sessionId == 0 ||
        calibrationSession_.status == CalibrationSessionStatus::Idle ||
        calibrationSession_.status == CalibrationSessionStatus::Applied ||
        calibrationSession_.status == CalibrationSessionStatus::Discarded ||
        calibrationSession_.status == CalibrationSessionStatus::Failed) {
        return false;
    }
    if (!meteringSchemes_ || !meteringSchemes_->ready() || !calibrationSessionTraces_ ||
        !calibrationSessionTraces_->ready() || !calibrationCanQuickGenerate(calibrationSession_) ||
        water_.snapshot().state != WaterState::Idle) {
        calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                    : CalibrationSessionStatus::Failed;
        calibrationSession_.updatedAt = nowSeconds;
        return saveCalibrationSession();
    }

    SegmentedCalibrationSample samples[kCalibrationMaxValidSamples]{};
    std::uint32_t sourceIds[kCalibrationMaxValidSamples]{};
    std::size_t sampleCount = 0;
    const SegmentedCalibrationOptions options = segmentedCalibrationOptionsFromConfig(config_);
    for (std::uint8_t i = 0; i < calibrationSession_.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = calibrationSession_.attempts[i];
        if (attempt.status != CalibrationAttemptStatus::Valid ||
            attempt.sessionTraceSlot >= kCalibrationSessionTraceSlots) {
            continue;
        }
        CalibrationStoredTrace stored{};
        if (!calibrationSessionTraces_->load(attempt.sessionTraceSlot, stored)) {
            continue;
        }
        appendSessionCalibrationSample(stored,
                                       *calibrationSessionTraces_,
                                       attempt.sessionTraceSlot,
                                       options,
                                       samples,
                                       kCalibrationMaxValidSamples,
                                       sourceIds,
                                       sampleCount);
    }

    SegmentedCalibrationResult result{};
    if (!computeSegmentedCalibration(samples, sampleCount, options, result) || !result.valid) {
        calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                    : CalibrationSessionStatus::Failed;
        calibrationSession_.updatedAt = nowSeconds;
        return saveCalibrationSession();
    }
    MeteringSchemeCandidate candidate{};
    fillCandidateFromSegmentedResult(candidate,
                                     result,
                                     options,
                                     sourceIds,
                                     sampleCount,
                                     nowSeconds,
                                     MeteringSchemeSource::CalibrationSession);
    calibrationCandidate_ = candidate;
    calibrationSession_.status = CalibrationSessionStatus::Generated;
    calibrationSession_.updatedAt = nowSeconds;
    pendingBeep_ = BeepPattern::Done;
    return saveCalibrationSession();
}

void AppController::clearCalibrationCandidate() {
    calibrationCandidate_ = MeteringSchemeCandidate{};
}

bool AppController::applyGeneratedCalibrationForWeb(std::uint32_t nowSeconds) {
    if (!meteringSchemes_ || !meteringSchemes_->ready() ||
        calibrationSession_.status != CalibrationSessionStatus::Generated ||
        water_.snapshot().state != WaterState::Idle) {
        return false;
    }
    if (!calibrationCandidate_.ready ||
        calibrationCandidate_.sourceType != MeteringSchemeSource::CalibrationSession) {
        return false;
    }
    std::uint32_t newId = 0;
    if (!meteringSchemes_->saveCandidateAsNew(calibrationCandidate_, "校准生成计量方案", nowSeconds, newId) ||
        !meteringSchemes_->setActiveScheme(newId, nowSeconds)) {
        return false;
    }
    calibrationCandidate_ = MeteringSchemeCandidate{};
    MeteringSchemeRecord active{};
    if (!meteringSchemes_->activeScheme(active) || !applyActiveMeteringScheme(active)) {
        return false;
    }
    calibrationSession_.status = CalibrationSessionStatus::Applied;
    calibrationSession_.appliedSchemeId = newId;
    calibrationSession_.updatedAt = nowSeconds;
    pendingBeep_ = BeepPattern::Done;
    return saveCalibrationSession();
}

bool AppController::canUseTdsCalibration() const {
    return waterSensors_ && localMode_ == LocalUiMode::Normal && water_.snapshot().state == WaterState::Idle;
}

bool AppController::startTdsCalibrationSessionForWeb(std::uint32_t nowSeconds) {
    return canUseTdsCalibration() && waterSensors_->startTdsCalibrationSession(nowSeconds);
}

bool AppController::startTdsCalibrationPointForWeb(std::uint16_t referencePpm, std::uint32_t nowSeconds) {
    return canUseTdsCalibration() && waterSensors_->startTdsCalibrationPoint(referencePpm, nowSeconds);
}

bool AppController::saveTdsCalibrationPointForWeb(std::uint32_t nowSeconds) {
    return canUseTdsCalibration() && waterSensors_->saveStableTdsCalibrationPoint(nowSeconds);
}

bool AppController::removeTdsCalibrationPointForWeb(std::uint8_t index, std::uint32_t nowSeconds) {
    return canUseTdsCalibration() && waterSensors_->removeTdsCalibrationPoint(index, nowSeconds);
}

bool AppController::discardTdsCalibrationForWeb() {
    return canUseTdsCalibration() && waterSensors_->discardTdsCalibrationSession();
}

