tangyangguang/Esp32_Faucet/src/app/AppController.cpp
bool AppController::applyTdsCalibrationForWeb(std::uint32_t nowSeconds) {
    if (!canUseTdsCalibration()) {
        return false;
    }
    SystemConfig updated = config_;
    if (!waterSensors_->applyReadyTdsCalibration(updated, nowSeconds)) {
        return false;
    }
    sanitizeConfig(updated);
    config_ = updated;
    water_.applyConfig(config_);
    waterSensors_->configure(config_);
    pendingBeep_ = BeepPattern::Done;
    return true;
}

bool AppController::saveTemperatureCalibrationForWeb(std::int16_t referenceCentiC) {
    if (!canApplyConfig() || !waterSensors_ || !config_.temperatureEnabled ||
        config_.temperatureKind != TemperatureKind::Ntc50kB3950) {
        return false;
    }
    const WaterSensorSnapshot sensors = waterSensors_->snapshot();
    if (!sensors.temperatureRawCentiC.valid) {
        return false;
    }
    config_.temperatureOffsetCentiC =
        static_cast<std::int16_t>(referenceCentiC - sensors.temperatureRawCentiC.value);
    config_.temperatureCalibrated = true;
    sanitizeConfig(config_);
    water_.applyConfig(config_);
    pendingBeep_ = BeepPattern::Done;
    return true;
}

TdsCalibrationSessionSnapshot AppController::tdsCalibrationSnapshot() const {
    return waterSensors_ ? waterSensors_->calibrationSnapshot() : TdsCalibrationSessionSnapshot{};
}

CalibrationApplyResult AppController::applyCalibrationFromRecord(const WaterRecord& record, std::uint32_t actualMl) {
    return applyCalibrationFromRecordInternal(record, actualMl, false, 0);
}

CalibrationApplyResult AppController::applyCalibrationFromRecordInternal(const WaterRecord& record,
                                                                         std::uint32_t actualMl,
                                                                         bool allowLocalCalibration,
                                                                         std::uint32_t calibratedAt) {
    if (water_.snapshot().state != WaterState::Idle ||
        (localMode_ == LocalUiMode::Calibration && !allowLocalCalibration)) {
        return CalibrationApplyResult::NotAvailable;
    }
    if (actualMl < kCalibrationMinActualMl || actualMl > kMaxVolumePresetMl) {
        return CalibrationApplyResult::InvalidActual;
    }
    if (record.pulseCount == 0 || !waterResultAllowsCalibration(record.result)) {
        return CalibrationApplyResult::InvalidRecord;
    }
    if (!recordCalibrations_) {
        return CalibrationApplyResult::NotAvailable;
    }
    WaterRecordCalibration calibration = makeWaterRecordCalibration(record);
    calibration.actualMl = actualMl;
    calibration.calibratedAt = calibratedAt;
    const float stablePulsePerMl = static_cast<float>(activeMeteringScheme_.params.stablePulsePerLiter) / 1000.0f;
    calibration.oldPulsePerMl = stablePulsePerMl;
    calibration.newPulsePerMl = stablePulsePerMl;
    calibration.oldStartupCompensationMl = activeMeteringScheme_.params.startupVolumeMl;
    calibration.newStartupCompensationMl = activeMeteringScheme_.params.startupVolumeMl;
    calibration.kind = WaterRecordCalibrationKind::PulsePerMl;
    if (!recordCalibrations_->upsert(calibration)) {
        return CalibrationApplyResult::NotAvailable;
    }
    if (pulseTraces_) {
        pulseTraces_->setActualMlByRecord(record, actualMl);
    }
    pendingBeep_ = BeepPattern::Done;
    localMode_ = LocalUiMode::Result;
    return CalibrationApplyResult::Saved;
}

void AppController::handleButtonEvent(ButtonEvent event,
                                      std::uint32_t nowMs,
                                      std::uint32_t nowUs,
                                      std::uint32_t nowSeconds,
                                      bool timeSynced,
                                      std::uint32_t bootId) {
    if (localMode_ == LocalUiMode::RecordCalibration) {
        handleLocalRecordCalibrationEvent(event, nowSeconds);
        return;
    }

    if (localMode_ == LocalUiMode::Calibration && event.type != ButtonEventType::None) {
        if (calibrationSession_.status == CalibrationSessionStatus::Preparing &&
            event.type == ButtonEventType::OkShort) {
            calibrationSession_.status = CalibrationSessionStatus::WaitingLocalRun;
            calibrationSession_.updatedAt = nowSeconds;
            saveCalibrationSession();
            pendingBeep_ = BeepPattern::Click;
            return;
        }
        if (calibrationSession_.status == CalibrationSessionStatus::WaitingLocalRun &&
            event.type == ButtonEventType::OkShort) {
            if (!beginCalibrationLocalRun(nowMs, nowUs, nowSeconds, timeSynced, bootId)) {
                pendingBeep_ = BeepPattern::Error;
            }
            return;
        }
        if (calibrationSession_.status == CalibrationSessionStatus::Running) {
            if (event.type == ButtonEventType::CancelDown || event.type == ButtonEventType::CancelShort ||
                event.type == ButtonEventType::CancelLong) {
                emergencyStop(nowMs);
                return;
            }
            if (event.type == ButtonEventType::OkShort) {
                const WaterSnapshot water = water_.snapshot();
                if (water_.togglePause(nowMs)) {
                    if (pulseTraces_ && activeTraceId_ != 0) {
                        const std::uint32_t elapsedUs = elapsedSince(nowUs, activeTraceStartUs_);
                        if (water.state == WaterState::Running) {
                            pulseTraces_->markPaused(activeTraceId_, elapsedUs);
                        } else if (water.state == WaterState::Paused) {
                            pulseTraces_->markResumedAfterPause(activeTraceId_, elapsedUs);
                        }
                    }
                    pendingBeep_ = BeepPattern::Click;
                }
                return;
            }
        }
        if (calibrationSession_.status == CalibrationSessionStatus::AwaitingActual &&
            (event.type == ButtonEventType::CancelShort || event.type == ButtonEventType::CancelLong)) {
            skipCalibrationAttemptForWeb(CalibrationSkipReason::Mistake, nowSeconds);
            pendingBeep_ = BeepPattern::Click;
            return;
        }
        switch (event.type) {
            case ButtonEventType::CancelDown:
            case ButtonEventType::CancelShort:
            case ButtonEventType::CancelLong:
                discardCalibrationSessionForWeb(nowSeconds);
                pendingBeep_ = BeepPattern::Click;
                break;
            case ButtonEventType::OkShort:
                break;
            case ButtonEventType::OkLong:
                break;
            case ButtonEventType::PlusShort:
            case ButtonEventType::PlusLong:
                break;
            case ButtonEventType::MinusShort:
            case ButtonEventType::MinusLong:
                break;
            default:
                break;
        }
        return;
    }

    if (localMode_ == LocalUiMode::Result && event.type != ButtonEventType::None) {
        if (event.type == ButtonEventType::OkLong) {
            return;
        }
        if ((event.type == ButtonEventType::CancelDown || event.type == ButtonEventType::CancelShort ||
             event.type == ButtonEventType::CancelLong) &&
            !elapsedAtLeast(nowMs, resultDisplayStartMs_, 500UL)) {
            return;
        }
        if (event.type == ButtonEventType::PlusShort || event.type == ButtonEventType::PlusLong) {
            exitResultDisplay(nowMs);
            if (water_.selectNextPreset()) {
                pendingBeep_ = BeepPattern::Click;
            }
            return;
        }
        if (event.type == ButtonEventType::MinusShort || event.type == ButtonEventType::MinusLong) {
            exitResultDisplay(nowMs);
            if (water_.selectPreviousPreset()) {
                pendingBeep_ = BeepPattern::Click;
            }
            return;
        }
        exitResultDisplay(nowMs);
        pendingBeep_ = BeepPattern::Click;
        return;
    }

    const WaterSnapshot water = water_.snapshot();
    switch (event.type) {
        case ButtonEventType::CancelDown:
        case ButtonEventType::CancelShort:
        case ButtonEventType::CancelLong:
            emergencyStop(nowMs);
            if (water.state == WaterState::Confirm || water.state == WaterState::Error) {
                water_.cancel(nowMs);
                pendingBeep_ = BeepPattern::Click;
            }
            break;
        case ButtonEventType::OkShort:
            if (water.state == WaterState::Idle || water.state == WaterState::Error) {
                if (water_.requestStart(nowMs)) {
                    adjustmentStepMl_ = config_.volumeAdjustStepMl;
                    timeAdjustmentStepSec_ = config_.timeAdjustStepSec;
                    pendingBeep_ = BeepPattern::Click;
                }
            } else if (water.state == WaterState::Confirm) {
                startSelectedPreset(nowMs, nowUs, nowSeconds, timeSynced, bootId);
            } else if (water.state == WaterState::Running || water.state == WaterState::Paused) {
                if (water_.togglePause(nowMs)) {
                    pendingBeep_ = BeepPattern::Click;
                }
            }
            break;
        case ButtonEventType::OkLong:
            break;
        case ButtonEventType::PlusShort:
        case ButtonEventType::PlusLong:
            if (water.state == WaterState::Confirm) {
                const std::uint32_t step =
                    water.mode == WaterMode::Time ? timeAdjustmentStepSec_ : adjustmentStepMl_;
                if (water_.adjustTarget(static_cast<std::int32_t>(step))) {
                    pendingBeep_ = BeepPattern::Click;
                }
            } else if ((water.state == WaterState::Idle || water.state == WaterState::Error) &&
                       water_.selectNextPreset()) {
                pendingBeep_ = BeepPattern::Click;
            }
            break;
        case ButtonEventType::MinusShort:
        case ButtonEventType::MinusLong:
            if (water.state == WaterState::Confirm) {
                const std::uint32_t step =
                    water.mode == WaterMode::Time ? timeAdjustmentStepSec_ : adjustmentStepMl_;
                if (water_.adjustTarget(-static_cast<std::int32_t>(step))) {
                    pendingBeep_ = BeepPattern::Click;
                }
            } else if ((water.state == WaterState::Idle || water.state == WaterState::Error) &&
                       water_.selectPreviousPreset()) {
                pendingBeep_ = BeepPattern::Click;
            }
            break;
        default:
            break;
    }
}

void AppController::startSelectedPreset(std::uint32_t nowMs,
                                        std::uint32_t nowUs,
                                        std::uint32_t nowSeconds,
                                        bool timeSynced,
                                        std::uint32_t bootId) {
    if (water_.confirmStart(nowMs)) {
        activeStartTimeSec_ = nowSeconds;
        activeStartTimeSynced_ = timeSynced;
        activeStartBootId_ = timeSynced ? 0 : bootId;
        resetRunFlowState();
        pendingBeep_ = BeepPattern::Click;
    }
}

void AppController::exitResultDisplay(std::uint32_t) {
    localMode_ = LocalUiMode::Normal;
    resultOkHoldActive_ = false;
    resultOkCalibrationEntered_ = false;
}

void AppController::updateResultOkHold(const AppTickInput& input) {
    if (localMode_ != LocalUiMode::Result || !lastResultRecordValid_ || !input.buttons.okPressed) {
        resultOkHoldActive_ = false;
        resultOkCalibrationEntered_ = false;
        return;
    }

