tangyangguang/Esp32_Faucet/src/app/AppController.cpp
bool AppController::saveCalibrationSession() {
    return calibrationSessions_ && calibrationSessions_->ready() && calibrationSessions_->save(calibrationSession_);
}

bool AppController::beginCalibrationLocalRun(std::uint32_t nowMs,
                                             std::uint32_t nowUs,
                                             std::uint32_t nowSeconds,
                                             bool timeSynced,
                                             std::uint32_t bootId) {
    if (calibrationSession_.status != CalibrationSessionStatus::WaitingLocalRun ||
        water_.snapshot().state != WaterState::Idle || !calibrationCanStartAttempt(calibrationSession_)) {
        return false;
    }
    if (!water_.requestStart(nowMs) || !water_.confirmStart(nowMs)) {
        return false;
    }
    calibrationSession_.status = CalibrationSessionStatus::Running;
    calibrationSession_.updatedAt = nowSeconds;
    saveCalibrationSession();
    activeStartTimeSec_ = nowSeconds;
    activeStartTimeSynced_ = timeSynced;
    activeStartBootId_ = timeSynced ? 0 : bootId;
    resetRunFlowState();
    if (pulseTraces_) {
        pulseTraces_->setRecentTraceLimit(kRecentPulseTraceCount);
        activeTraceId_ = pulseTraces_->beginTrace(nowSeconds, config_.pulseMinIntervalUs);
        activeTraceStartUs_ = nowUs;
    }
    pendingBeep_ = BeepPattern::Click;
    return true;
}

void AppController::resetRunFlowState() {
    flow_.reset();
    lastFlowVolumeMl_ = 0;
    currentFlowMlPerMin_ = 0;
    instantFlowMlPerMin_ = 0;
    windowFlowMlPerMin_ = 0;
    displayFlowMlPerMin_ = 0;
    runAverageFlowMlPerMin_ = 0;
    if (waterSensors_) {
        waterSensors_->beginRun();
    }
}

std::uint8_t AppController::selectCalibrationSessionTraceSlot() const {
    bool occupied[kCalibrationSessionTraceSlots]{};
    for (std::uint8_t i = 0; i < calibrationSession_.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = calibrationSession_.attempts[i];
        if ((attempt.status == CalibrationAttemptStatus::Valid ||
             attempt.status == CalibrationAttemptStatus::PendingActual) &&
            attempt.sessionTraceSlot < kCalibrationSessionTraceSlots) {
            occupied[attempt.sessionTraceSlot] = true;
        }
    }
    for (std::uint8_t slot = 0; slot < kCalibrationSessionTraceSlots; ++slot) {
        if (!occupied[slot]) {
            return slot;
        }
    }
    return 255;
}

void AppController::persistCalibrationPendingAttempt(const WaterRecord& record, std::uint32_t nowSeconds) {
    if (localMode_ != LocalUiMode::Calibration ||
        calibrationSession_.status != CalibrationSessionStatus::Running ||
        !calibrationSessionTraces_ || !calibrationSessionTraces_->ready() ||
        calibrationSession_.attemptCount >= kCalibrationMaxAttempts) {
        return;
    }

    const std::uint8_t slot = selectCalibrationSessionTraceSlot();
    CalibrationAttempt attempt{};
    attempt.attemptIndex = calibrationSession_.attemptCount;
    attempt.sessionTraceSlot = slot;
    attempt.record = record;
    attempt.targetHintMl = record.targetValue;
    attempt.status = CalibrationAttemptStatus::PendingActual;

    if (slot >= kCalibrationSessionTraceSlots) {
        attempt.status = CalibrationAttemptStatus::Invalid;
        attempt.invalidReason = CalibrationInvalidReason::StorageFailed;
        appendCalibrationAttempt(calibrationSession_, attempt);
        calibrationSession_.status = calibrationCanStartAttempt(calibrationSession_) ? CalibrationSessionStatus::WaitingLocalRun
                                                                                    : CalibrationSessionStatus::Failed;
        calibrationSession_.updatedAt = nowSeconds;
        saveCalibrationSession();
        return;
    }

    const WaterPulseTrace* trace = pulseTraces_ ? pulseTraces_->findByRecord(record) : nullptr;
    if (!trace || trace->sampleCount == 0 || trace->sampleCount > kPulseTraceMaxRawEdgesPerTrace) {
        attempt.status = CalibrationAttemptStatus::Invalid;
        attempt.invalidReason = CalibrationInvalidReason::TruncatedTrace;
        appendCalibrationAttempt(calibrationSession_, attempt);
        calibrationSession_.status = CalibrationSessionStatus::WaitingLocalRun;
        calibrationSession_.updatedAt = nowSeconds;
        saveCalibrationSession();
        return;
    }

    appendCalibrationAttempt(calibrationSession_, attempt);
    calibrationSession_.status = CalibrationSessionStatus::AwaitingActual;
    calibrationSession_.updatedAt = nowSeconds;
    saveCalibrationSession();
}

void AppController::syncFlow(std::uint32_t nowUs) {
    if (calibrationValveOpen_) {
        return;
    }
    if (water_.snapshot().state != WaterState::Running) {
        return;
    }

    const FlowSnapshot flow = flow_.snapshot(nowUs);
    if (flow.volumeMl > lastFlowVolumeMl_) {
        water_.addVolume(flow.volumeMl - lastFlowVolumeMl_);
        lastFlowVolumeMl_ = flow.volumeMl;
    }
}

void AppController::finishPulseTrace(const WaterRecord& record,
                                     WaterPulseTraceState finalState,
                                     const FlowSnapshot& flow,
                                     std::uint32_t nowUs) {
    if (!pulseTraces_ || activeTraceId_ == 0) {
        return;
    }
    (void)flow;
    pulseTraces_->finishTrace(activeTraceId_, record, finalState, elapsedSince(nowUs, activeTraceStartUs_));
    activeTraceId_ = 0;
    activeTraceStartUs_ = 0;
}

void AppController::syncValve(std::uint32_t nowMs) {
    const bool desiredOpen = water_.snapshot().valveOpen || calibrationValveOpen_;
    if (desiredOpen && !lastValveDesiredOpen_) {
        valve_.open(nowMs);
    } else if (!desiredOpen && lastValveDesiredOpen_) {
        valve_.close();
    }
    valve_.tick(nowMs);
    lastValveDesiredOpen_ = desiredOpen;
    if (valveOutputSink_) {
        valveOutputSink_(valve_.output());
    }
}

void AppController::processResult(std::uint32_t startTime,
                                  const PeriodKeys& periodKeys,
                                  bool periodKeysValid,
                                  bool startTimeSynced,
                                  std::uint32_t bootId,
                                  std::uint32_t nowSeconds,
                                  const FlowSnapshot& flow,
                                  std::uint32_t nowUs) {
    const WaterTaskResult result = water_.result();
    if (!result.valid) {
        return;
    }

    WaterRecord record{
        startTime,
        result.volumeMl,
        result.targetValue,
        flow.pulseCount,
        flow.rejectedPulses,
        result.durationSec,
        result.mode,
        result.result,
        result.selectedPreset,
        0,
        activeMeteringScheme_.id,
        {0, 0, 0, 0},
    };
    if (!startTimeSynced) {
        markWaterRecordBootId(record, bootId);
    }
    if (waterSensors_) {
        const WaterSensorRunSummary sensors = waterSensors_->finishRun();
        record.temperatureAvgCentiC = sensors.temperatureAvgCentiC;
        record.temperatureMinCentiC = sensors.temperatureMinCentiC;
        record.temperatureMaxCentiC = sensors.temperatureMaxCentiC;
        record.tdsAvgPpm = sensors.tdsAvgPpm;
        record.tdsMinPpm = sensors.tdsMinPpm;
        record.tdsMaxPpm = sensors.tdsMaxPpm;
        record.tdsVoltageAvgMv = sensors.tdsVoltageAvgMv;
        record.sensorSampleCount = sensors.sensorSampleCount;
        record.sensorFlags = sensors.sensorFlags;
        record.tdsCalibrationRevisionAtRun = sensors.tdsCalibrationRevisionAtRun;
        record.tdsCalibrationModeAtRun = sensors.tdsCalibrationModeAtRun;
        record.tdsCalibratedAtRun = sensors.tdsCalibratedAtRun;
        record.tdsTemperatureCompensatedAtRun = sensors.tdsTemperatureCompensatedAtRun;
        record.tdsTempFallback25CAtRun = sensors.tdsTempFallback25CAtRun;
    }

    APP_RESULT_LOG_I("app",
                     "water_result_ready result=%u volume_ml=%lu target=%lu pulses=%lu scheme_id=%lu",
                     static_cast<unsigned>(result.result),
                     static_cast<unsigned long>(record.volumeMl),
                     static_cast<unsigned long>(record.targetValue),
                     static_cast<unsigned long>(record.pulseCount),
                     static_cast<unsigned long>(record.meteringSchemeId));
    const WaterPulseTraceState traceState = traceStateForResult(result.result);
    finishPulseTrace(record, traceState, flow, nowUs);

    lastResultRecord_ = WaterRecord{};
    lastResultRecordValid_ = false;
    APP_RESULT_LOG_I("app", "water_record_append_begin");
    lastRecordWriteOk_ = records_.append(record);
    APP_RESULT_LOG_I("app", "water_record_append_done ok=%s", lastRecordWriteOk_ ? "yes" : "no");
    if (lastRecordWriteOk_ && recordCalibrations_ && record.pulseCount > 0 &&
        waterResultAllowsCalibration(record.result)) {
        lastResultRecord_ = record;
        lastResultRecordValid_ = true;
        localCalibrationActualMl_ =
            std::min<std::uint32_t>(kMaxVolumePresetMl,
                                    std::max<std::uint32_t>(kCalibrationMinActualMl, record.volumeMl));
        localCalibrationStepMl_ = kLocalRecordCalibrationStepMl;
    }
    if (lastRecordWriteOk_ && meteringSchemes_ && !activeMeteringScheme_.usedEver) {
        activeMeteringScheme_.usedEver = true;
        meteringSchemes_->markUsedAfterRecordWrite(activeMeteringScheme_.id);
    }
    if (periodKeysValid) {
        statistics_.addWater(result.volumeMl, periodKeys);
    }
    filters_.addWater(result.volumeMl);
    APP_RESULT_LOG_I("app",
                     "water_runtime_totals_updated period_keys=%s today_ml=%lu total_ml=%lu",
                     periodKeysValid ? "valid" : "invalid",
                     static_cast<unsigned long>(statistics_.record().todayMl),
                     static_cast<unsigned long>(statistics_.record().totalMl));
    persistCalibrationPendingAttempt(record, nowSeconds);
    persistenceDirty_ = true;
    pendingBeep_ = result.result == WaterResult::Completed ? BeepPattern::Done : BeepPattern::Error;
}

}  // namespace faucet
